/*******************************************************************************
* 文件名称：md_gps.c
*
* 摘    要：GPS相关初始化
*
* 当前版本：
* 作    者：Acorss工作室
* 日    期：2018/04/30
* 编译环境：keil5
*
* 历史信息：
*******************************************************************************/
#include "md_gps.h"
#include "usart.h"
#include "md_ubx.h"
#include "ringbuffer.h"


/*缓冲区管理器*/
//ringbuffer管理变量
RingBuffer  m_GPS_RX_RingBuffMgr;
/*GPS接收数据缓冲区数组*/
uint8_t   m_GPS_RX_Buff[GPS_READ_BUFFER_SIZE*10];

//接收数据存放变量
uint32_t braud;
uint8_t gps_rx_temp;
/*******************************函数声明****************************************
* 函数名称: void GPS_RB_Init(void)
* 输入参数:
* 返回参数:
* 功    能: 初始化一个循环队列，用来管理接收到的串口数据。其实就是一个数据缓冲区
* 作    者: by Across
* 日    期: 2015/05/01
*******************************************************************************/
void GPS_RB_Init(void)
{
	//将m_GPS_RX_Buffm_GPS_RX_RingBuffMgr环队列进行关联管理。
	rbInit(&m_GPS_RX_RingBuffMgr, m_GPS_RX_Buff, sizeof(m_GPS_RX_Buff));
}

/*******************************函数声明****************************************
* 函数名称: void GPS_RB_Clear(void)
* 输入参数:
* 返回参数:
* 功    能: 归零ringbuffer里面的设置。
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void GPS_RB_Clear(void)
{
	rbClear(&m_GPS_RX_RingBuffMgr);
}

/*******************************函数声明****************************************
* 函数名称: uint8_t  GPS_RB_IsOverFlow(void)
* 输入参数:
* 返回参数:  溢出为1，反之为0
* 功    能: 判断缓冲器是否溢出
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
uint8_t  GPS_RB_IsOverFlow(void)
{
	return m_GPS_RX_RingBuffMgr.flagOverflow;
}

/*******************************函数声明****************************************
* 函数名称: void GPS_RB_Push(uint8_t data)
* 输入参数: data：待压入的数据
* 返回参数:
* 功    能: 将接收的数据压入缓冲区
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void GPS_RB_Push(uint8_t data)
{
	rbPush(&m_GPS_RX_RingBuffMgr, (uint8_t)(data & (uint8_t)0xFFU));
}

/*******************************函数声明****************************************
* 函数名称: uint8_t GPS_RB_Pop(void)
* 输入参数:
* 返回参数: uint8_t 读出的数据
* 功    能: 从缓冲器读出数据
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
uint8_t GPS_RB_Pop(void)
{
	return rbPop(&m_GPS_RX_RingBuffMgr);
}

/*******************************函数声明****************************************
* 函数名称: uint8_t GPS_RB_HasNew(void)
* 输入参数:
* 返回参数:
* 功    能: 判断是否有新的数据
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
uint8_t GPS_RB_HasNew(void)
{
	return !rbIsEmpty(&m_GPS_RX_RingBuffMgr);
}

/*******************************函数声明****************************************
* 函数名称: uint16_t GPS_RB_Count(void)
* 输入参数:
* 返回参数:
* 功    能: 判断有多少个新数据
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
uint16_t GPS_RB_Count(void)
{
	return rbGetCount(&m_GPS_RX_RingBuffMgr);
}

/*******************************函数声明****************************************
* 函数名称: void GPS_Init(void)
* 输入参数:
* 返回参数:
* 功    能: 初始化gps：初始化ruingbuffer，启动DMA数据接收，配置GPS进入UBX模式等设置。
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void GPS_Init(void)
{
	GPS_RB_Init();
	//GPS_DEBUG("GPS begin configure----\r\n");
	configure(&braud,GPS,30000);
}

/*******************************函数声明****************************************
* 函数名称: void GPS_Baud_Reset(uint32_t baud)
* 输入参数:
* 返回参数:
* 功    能: 重新设置GPS通信波特率
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void GPS_Baud_Reset(uint32_t baud)
{
	Set_UART4_Baud(baud);
	HAL_UART_Receive_DMA(&huart4,&gps_rx_temp,1);
}

/*******************************函数声明****************************************
* 函数名称: void GPS_RX_InterruptHandler(void)
* 输入参数:
* 返回参数:
* 功    能: GPS的中断接收处理函数，主要是将数据压入ringbuffer管理器
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void GPS_RX_InterruptHandler(void)
{
	//数据压入
	rbPush(&m_GPS_RX_RingBuffMgr,gps_rx_temp );
	//GPS_DEBUG("%s",gps_rx_temp);
}

/*******************************函数声明****************************************
* 函数名称: Loop_GPS_Parse(void)
* 输入参数:
* 返回参数:
* 功    能: 在main函数中不间断调用此函数
* 作    者: by Across
* 日    期: 2018/05/07
*******************************************************************************/
void Loop_GPS_Parse(void)
{
	//主控制器有时间就运行该函数
	UBX_Receive();
	//GPS_DEBUG("length:%d",UBX_PAYLOAD_RX_NAV_PVT_SIZE_UBX8);
}
